const data_table = {
  朝聖者: {
    words: [
      "人", "我", "你", "朝聖者", "戰士", "傳道者", "天神", "",
      "找到", "開", "走", "看", "愛", "幫", "說", "想要",
      "製造", "關", "", "", "植物園", "墓地", "修道院", "教堂",
      "往上", "植物", "你好", "死", "音樂", "不", "自由", "",
      "門", "陶罐", "透鏡", "鑰匙", "樂器", "藥水", "", "",
    ],
    keys: [
      "往上", "植物", "你好", "音樂", "不", "自由", "想要", "找到", "死", -1,
      1, "開", "關", "走", "看", "愛", "幫", "說", "製造", "天神", -1,
      2, "人", "我", "你", "藥水", "門", "陶罐", "透鏡", "鑰匙", "樂器", -1,
      1, "戰士", "傳道者", "朝聖者", "植物園", "墓地", "修道院", "教堂",
    ],
    key_codes: {
      1: "往上", 2: "植物", 3: "你好", 4: "音樂", 5: "不", 6: "自由", 7: "想要", 8: "找到", 9: "死",
      q: "開", w: "關", e: "走", r: "看", t: "愛", y: "幫", u: "說", i: "製造", o:"天神",
      a: "人", s: "我", d: "你", f: "藥水", g: "門", h: "陶罐", j: "透鏡", k: "鑰匙", l: "樂器",
      z: "戰士", x: "傳道者", c: "朝聖者", v: "植物園", b: "墓地", n: "修道院", m: "教堂",
    },
    tool_keys: {
      left: {r: 4, c: -6},
      right: {r: 4, c: -3},
      del: {r: 1, c: -3},
      send: {r: 2, c: -4},
    },
  },
  戰士: {
    words: [
      "們", "不潔者", "不", "前進", "戰士", "等待", "月亮", "鑰匙",
      "天職", "要塞", "欣賞", "死亡", "推", "保護", "幫助", "音樂",
      "天選者", "拿", "大", "小", "箱子", "推車", "製造", "太陽",
      "放", "瓶子", "武器", "召喚", "寶藏", "敲鐘人", "科學家", "想要",
      "害怕", "樂器", "帆船", "天秤",
    ],
    keys: [
      "戰士", "天選者", "不潔者", "敲鐘人", "科學家", "們", "天職", "召喚", "寶藏", "要塞", -1,
      1, "前進", "等待", "推", "保護", "拿", "放", "欣賞", "製造", "幫助", "想要", -1,
      2, "害怕", "不", "死亡", "大", "小", "箱子", "瓶子", "推車", "武器", -1,
      1, "月亮", "太陽", "鑰匙", "帆船", "天秤", "樂器", "音樂",
    ],
    key_codes: {},
    tool_keys: {
      left: {r: 4, c: -6},
      right: {r: 4, c: -3},
      del: {r: 1, c: -3},
      send: {r: 2, c: -4},
    },
  },
  吟遊詩人: {
    words: [
      "行", "你", "愛", "吟遊詩人", "是", "想要", "們", "武器",
      "找到", "否", "拿", "鋸子", "戰士", "愚蠢", "樂器", "你好",
      "美", "音樂", "問", "我", "怪物", "滑稽劇", "鎚子", "玩",
      "市民廣場", "同胞", "火", "指南針", "北", "溪", "路徑", "南",
      "東", "劇院", "要塞", "書本", "風車", "隱修院", "自由", "鉗子",
      "上升", "人",
    ],
    keys: [
      "行", "你", "愛", "吟遊詩人", "是", "想要", "們", "武器", "路徑", "劇院", "要塞", -1,
      1, "找到", "否", "拿", "鋸子", "戰士", "愚蠢", "樂器", "你好", "書本", "風車", "隱修院", -1,
      2, "美", "音樂", "問", "我", "怪物", "滑稽劇", "鎚子", "玩", "自由", "鉗子", -1,
      1, "市民廣場", "同胞", "火", "指南針", "東", "南", "西", "北", "上升", "人", -1,
    ],
    key_codes: {},
    tool_keys: {
      left: {r: 4, c: -6},
      right: {r: 4, c: -3},
      del: {r: 1, c: -3},
      send: {r: 2, c: -4},
    },
  },
  煉金術師: {
    words: [
      "0", "1", "2", "3", "4", "5", "6", "7",
      "8", "9", "金", "銀", "銅", "碳", "你", "我",
      "們", "尋找", "找到", "門", "精靈", "圖書館", "礦場", "關",
      "質變", "食堂", "實驗室", "煉金術師", "幫", "書", "火", "吟遊詩人",
      "配方", "同胞", "製作", "怪物", "戰士", "開", "害怕", "不",
      "死", "植物",
    ],
    keys: [
      "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "不", -1,
      "金", "銀", "銅", "碳", "尋找", "找到", "關", "開", "製作", "質變", "門",-1,
      "你", "我", "們", "精靈", "煉金術師", "吟遊詩人", "戰士", "怪物", "同胞", "配方", "植物", -1, 
      "害怕", "死", "圖書館", "礦場", "食堂", "實驗室", "幫", "火", "書",
      
    ],
    key_codes: {},
    tool_keys: {
      left: {r: 4, c: -6},
      right: {r: 4, c: -3},
      del: {r: 1, c: -3},
      send: {r: 2, c: -4},
    },
  },

  // 空白: {
    // words: [
      // "", "", "", "", "", "", "", "",
    // ],
    // keys: [],
    // key_codes: {},
    // tool_keys: {
      // left: {r: 4, c: -6},
      // right: {r: 4, c: -3},
      // del: {r: 1, c: -3},
      // send: {r: 2, c: -4},
    // },
  // },
};
